app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY id DESC
---
  def index
    @posts = Post.order("id DESC").all

INSERT INTO "posts" ("title", "image", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "ad"], ["image", "ad.jpg"], ["description", "ad"], ["created_at", "2015-10-04 14:51:55.041323"], ["updated_at", "2015-10-04 14:51:55.041323"]]
---
  def create
    @post = Post.new(post_params)

    if @post.save

UPDATE "posts" SET "image" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["image", "bruce_and_brandon.jpg"], ["updated_at", "2015-10-08 19:54:08.710056"], ["id", 12]]
---
  def update
    if @post.update(post_params)